InformationRegisters/МножителиЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>МножителиЕдиницИзмерения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Множитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтандартнаяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МножителиЕдиницИзмерения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтандартнаяЕдиницаИзмеренияПриИзменении(Элемент)
	
	Если Запись.СтандартнаяЕдиницаИзмерения Тогда
		Элементы.Множитель.ТолькоПросмотр = Истина;
		Запись.Множитель = 1;
	Иначе
		Элементы.Множитель.ТолькоПросмотр = Ложь;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	Запись.ВидЕдиницыИзмерения = ПолучитьВидЕдиницыИзмерения(Запись.ЕдиницаИзмерения);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидЕдиницыИзмерения(ЕдиницаИзмерения)
	Возврат ЕдиницаИзмерения.ВидЕдиницыИзмерения;
КонецФункции

// Данная процедура предназначена для проверки стандартной единицы измерения
// в разрезе вида единицы измерения данной записи
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МножителиЕдиницИзмерения.ВидЕдиницыИзмерения.Наименование КАК ВидЕдиницыИзмеренияНаименование,
		|	КОЛИЧЕСТВО(*) КАК КоличествоСтандЕдиницИзмерении
		|ИЗ
		|	РегистрСведений.МножителиЕдиницИзмерения КАК МножителиЕдиницИзмерения
		|ГДЕ
		|	МножителиЕдиницИзмерения.СтандартнаяЕдиницаИзмерения = Истина И
		| 	МножителиЕдиницИзмерения.ВидЕдиницыИзмерения = &Вид
		|СГРУППИРОВАТЬ ПО
		|	МножителиЕдиницИзмерения.ВидЕдиницыИзмерения";
	
	Запрос.УстановитьПараметр("Вид", Запись.ВидЕдиницыИзмерения);
	РезультатЗапроса = Запрос.Выполнить();	
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	
		Если Выборка.КоличествоСтандЕдиницИзмерении > 0 И Запись.СтандартнаяЕдиницаИзмерения Тогда
			Отказ = Истина;
			Сообщить("Невозможно добавить новую запись: Запись со стандартной единицей измерения уже существует!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
